Revit 2026 API

# BuiltInFailuresRevisionCloudFailures Class

---

Failures about RevisionCloud.

SystemObject Autodesk.Revit.DBBuiltInFailuresRevisionCloudFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RevisionCloudFailures
```
```vb
Public NotInheritable Class RevisionCloudFailures
```
```cpp
public ref class RevisionCloudFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevisionCloudFailures = class end
```

The BuiltInFailuresRevisionCloudFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ModifyingIssuedRevisionCloudOnUpgrade | During upgrade, an issued revision cloud was moved. Please double check the revision cloud to ensure it is located in the correct place. |
|  | ProhibitCreationInIssued | The most current project revision has been issued. No new revision clouds can be created in it. Please add a new revision to the global revision table. |
|  | ProhibitModificationOfIssuedRevisionCloud | Issued Revision Clouds can't be modified. |
|  | ProhibitSwitchFromIssuedRevision | Can't remove cloud from an Issued Revision. |
|  | ProhibitSwitchToIssuedRevision | Can't add cloud to an Issued Revision. |

#### Reference

Autodesk.Revit.DB Namespace